In [145]:
import pandas as pd
import numpy as np

In [146]:
df = pd.read_csv ('drinks.csv')

In [147]:
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [148]:
df.tail()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [149]:
a=df.sort_values('total_litres_of_pure_alcohol', axis = 0, ascending = False)

In [150]:
a.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
15,Belarus,142,373,42,14.4,EU
98,Lithuania,343,244,56,12.9,EU
3,Andorra,245,138,312,12.4,EU
68,Grenada,199,438,28,11.9,NaN
45,Czech Republic,361,170,134,11.8,EU

In [151]:
df.groupby("continent")["total_litres_of_pure_alcohol"].describe()

           count      mean       std  min   25%    50%     75%   max
continent
AF          53.0  3.007547  2.647557  0.0  0.70   2.30   4.700   9.1
AS          44.0  2.170455  2.770239  0.0  0.10   1.20   2.425  11.5
EU          45.0  8.617778  3.358455  0.0  6.60  10.00  10.900  14.4
OC          16.0  3.381250  3.345688  0.0  1.00   1.75   6.150  10.4
SA          12.0  6.308333  1.531166  3.8  5.25   6.85   7.375   8.3

In [152]:
df.groupby('continent')[['beer_servings','spirit_servings','wine_servings']].mean()

           beer_servings  spirit_servings  wine_servings
continent
AF             61.471698        16.339623      16.264151
AS             37.045455        60.840909       9.068182
EU            193.777778       132.555556     142.222222
OC             89.687500        58.437500      35.625000
SA            175.083333       114.750000      62.416667

In [153]:
df.groupby('continent')['beer_servings'].std()

continent
AF    80.557816
AS    49.469725
EU    99.631569
OC    96.641412
SA    65.242845
Name: beer_servings, dtype: float64

In [154]:
df.groupby('continent')['spirit_servings'].median()

continent
AF      3.0
AS     16.0
EU    122.0
OC     37.0
SA    108.5
Name: spirit_servings, dtype: float64

In [155]:
df.groupby('continent')['wine_servings'].aggregate(['min','mean'])

           min        mean
continent
AF           0   16.264151
AS           0    9.068182
EU           0  142.222222
OC           0   35.625000
SA           1   62.416667

In [156]:
df.groupby('continent')['total_litres_of_pure_alcohol'].aggregate(['mean','count'])

               mean  count
continent
AF         3.007547     53
AS         2.170455     44
EU         8.617778     45
OC         3.381250     16
SA         6.308333     12

In [157]:
mervi = df.sort_values(by=['wine_servings'],ascending=False)

In [158]:
mervi.head(1)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
61,France,127,151,370,11.8,EU

In [159]:
merv = df.sort_values(by=['beer_servings'],ascending=False)

In [160]:
merv.head(1)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
117,Namibia,376,3,1,6.8,AF

In [166]:
abc = df.sort_values(by=['spirit_servings'],ascending=False)

In [167]:
abc.head(1)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
68,Grenada,199,438,28,11.9,NaN

In [174]:
datafr = pd.DataFrame({'gruplar': ['beer_servings', 'spirit_servings', 'wine_servings'],
                   'degisken1': [10,23,33],
                   'degisken2': [100,253,333]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])

In [192]:
c =datafr.T

In [193]:
c

                       0                1              2
gruplar    beer_servings  spirit_servings  wine_servings
degisken1             10               23             33
degisken2            100              253            333

In [200]:
df_a = c.iloc[1:3,0:1]

             0
degisken1   10
degisken2  100

0    110
dtype: int64